package com.friendsit.dailyislambangla;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

public class Allah_Name extends AppCompatActivity {

    RecyclerView recyclerView;
    String[] arr = {
            "১. আর রাহমান – পরম দয়ালু", "২. আর রহিম – অতিশয় মেহেরবান", "৩. আল মালিক – সর্বকর্তৃত্বময়", "৪. আল কুদ্দুস – অতি পবিত্র", "৫. আস সালাম – শান্তি দানকারী",
            "৬. আল মুমিন – নিরাপত্তা ও ঈমান দানকারী", "৭. আল মুহাইমিন – পরিপূর্ণ রক্ষণাবেক্ষণকারী", "৮. আল আজিজ – পরাক্রমশালী", "৯. আল জাব্বার – দুর্নিবার", "১০. আল মুতাকাব্বির – নিরঙ্কুশ শ্রেষ্ঠত্বের অধিকারী",
            "১১. আল খালিক – সৃষ্টিকর্তা", "১২. আল বারী – সঠিকভাবে সৃষ্টিকারী", "১৩. আল মুসাউইর – আকৃতি দানকারী", "১৪. আল গাফ্ফার – পরম ক্ষমাশীল", "১৬. আল ক্বাহার – কঠোর",
            "১৭. আল ওয়াহ্হাব – সবকিছু দানকারী", "১৮. আর রাজ্জাক – রিযিকদাতা", "১৯. আল ফাত্তাহ – বিজয়দানকারী", "২০. আল আলীম – সর্বজ্ঞ", "২১. আল বাসিত – প্রশস্তকারী", "২২. আল খাফিদ – অবনতকারী",
            "২৩. আর রাফী – উন্নতকারী", "২৪. আল মুজিব – সম্মান দানকারী", "২৫. আল মুদ্বিল্ল – (অবিশ্বাসীদের) বেইজ্জতকারী", "২৬. আস সামি – সর্বশ্রোতা", "২৭. আল বাসীর – সর্ববিষয় দর্শনকারী", "২৮. আল হাকাম – অতল বিচারক",
            "২৯. আল আদল – পরিপূর্ণ ন্যায়বিচারক", "৩০. আল লতিফ – সকল গোপন বিষয়ে অবগত", "৩১. আল খাবির – সকল বিষয়ে জ্ঞাত", "৩২. আল হালিম – অত্যন্ত ধর্য্যশীল", "৩৩. আল আজিম – সর্বত্ত মর্যাদাশীল",
            "৩৪. আল গফুর – পরম ক্ষমাশীল", "৩৫. আস শাকুর – গুন্গ্রাহী", "৩৬. আল আলী – উচ্চ মর্যাদাশীল", "৩৭. আল কাবিইর – সুমহান", "৩৮. আল হাফীজ – সংরক্ষণকারী", "৩৯. আল মুক্বিত – সকলের জীবনোপকরণ দানকারী",
            "৪০. আল হাসিব – হিসাব গ্রহণকারী", "৪১. আল জলীল- পরম মর্যাদার অধিকারী", "৪২. আল কারীম – সুমহান দাতা", "৪৩. আল রাক্বীব – তত্ত্বাবধায়ক", "৪৪. আল মুজীব – কবুলকারী", "৪৫. আল ওয়াসি – সর্বত্ত বিরাজমান",
            "৪৬. আল হাকীম – পরম প্রজ্ঞাময়", "৪৭. আল ওয়াদুদ – (বান্দাদের প্রতি) সদয়", "৪৮. আল মাজীদ – সকল মর্যাদার অধিকারী", "৪৯. আল বাইস – পুনরুজ্জীবিতকারী", "৫০. আশ শাহীদ – সর্বজ্ঞ স্বাক্ষী", "৫১. আল হাক্ব – পরম সত্য",
            "৫২. আল ওয়াকিল – পরম নির্ভরযোগ্য কর্ম-সম্পাদনকারী", "৫৩. আল ক্বাউইউ – পরম শক্তির অধিকারী", "৫৪. আল মাতীন – সুদৃঢ়", "৫৫. আল ওয়ালীইউ – অভিভাবক ও সাহায্যকারী", "৫৬. আল হামীদ – সকল প্রশংসার অধিকারী",
            "৫৭. আল মুহসি – সকল সৃষ্টির ব্যাপারে অবগত", "৫৮. আল মুব্দি – প্রথমবার সৃষ্টিকর্তা", "৫৯. আল মুঈদ – পুনরায় সৃষ্টিকর্তা", "৬০. আল মুহয়ি – জীবন দানকারী", "৬১. আল মুমীত – মৃত্যু দানকারী", "৬২. আল হাইয়্যু – চিরঞ্জীব",
            "৬৩. আল ক্বাইয়ূম – সমস্ত কিছুর ধারক ও সংরক্ষণকারী", "৬৪. আল ওয়াজীদ – অফুরন্ত ভান্ডারের অধিকারী", "৬৫. আল মাজীদ – শ্রেষ্ঠত্বের অধিকারী", "৬৬. আল ওয়া’হিদ – এক ও অদ্বিতীয়",
            "৬৭. আল আহাদ – এক", "৬৮. আস সামাদ – অমুখাপেক্ষি", "৬৯. আল ক্বাদীর – সর্বশক্তিমান", "৭০. আল মুক্তাদির – নিরঙ্কুশ সিদ্ধান্তের অধিকারী", "৭১. আল মুক্বদ্দিম – অগ্রসারক", "৭২. আল মুয়াক্ষীর – অবকাশ দানকারী",
            "৭৩. আল আউয়াল – অনাদি", "৭৪. আল আখির – অনন্ত, সর্বশেষ", "৭৫. আল জাহির – সম্পূর্ণরূপে প্রকাশিত", "৭৬. আল বাত্বিন – দৃষ্টি হতে অদৃশ্য", "৭৭. আল ওয়ালী – সমস্ত কিছুর অভিভাবক",
            "৭৮. আল মুতা’আলী – সৃষ্টির গুণাবলীর উর্দ্ধে", "৭৯. আল বার্ – পরম উপকারী", "৮০. আত তাওয়াব – তাওবার তৌফিক দানকারী ও কবুলকারী", "৮১. আল মুনতাক্বীম – প্রতিশোধ গ্রহণকারী", "৮২. আল আফঊ – পরম উদার",
            "৮৩. আর রউফ – পরম স্নেহশীল", "৮৪. মালিকুল মূলক – সমগ্র জগতের বাদশাহ", "৮৫. যুল জালালী ওয়াল ইকরাম – মহিমান্বিত ও দয়াবান সত্তা", "৮৬. আল মুক্বসিত – হকদারের হোক আদায়কারী",
            "৮৭. আল জামিই – একত্রকারী, সমবেতকারী", "৮৮. আল গানি – অমুখাপেক্ষি ধনী", "৮৯. আল মুগনিই – পরম অভাবমোচনকারী", "৯০. আল মানিই – অকল্যাণরোধক", "৯১. আয্ যর – ক্ষতিসাধনকারী", "৯২. আন নাফিই’ – কল্যাণকারী",
            "৯৩. আন নূর – পরম আলো", "৯৪. আল হাদী – পথ প্রদর্শক", "৯৫. আল বাদীই – অতুলনীয়", "৯৬. আল বাক্বী – চিরস্থায়ী, অবিনশ্বর",
            "৯৭. আল ওয়ারিস – উত্তরাধিকারী", "৯৮. আর রাশীদ – সঠিক পথ প্রদর্শক", "৯৯. আস সাবুর – অত্যাধিক ধর্য্য ধারণকারী"};


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_allah_name);
        this.setTitle(getString(R.string.Allah_Name));

        recyclerView = findViewById(R.id.recylerView);

        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        CustomAdapter c = new CustomAdapter(arr);
        recyclerView.setAdapter(c);

    }
}